rainer20512/stm32-fw/stm32l4/Src/debug_pwr_rcc.c
/*
 *************************************************************
 * Functions to dump RCC settings
 *************************************************************
 */


const char * const msirange_txt[]={"100kHz", "200kHz", "400kHz", "800kHz",
                            "1MHz", "2MHz", "4MHz", "8MHz", "16MHz", "24MHz", "32MHz", "48MHz" };
static const char* DBG_get_msirange_text ( uint32_t sel, uint32_t msirgsel )
{
  if ( msirgsel ) {
    // full range 
    if ( sel < sizeof(msirange_txt)/sizeof(char *) ) 
      return msirange_txt[sel];
    else
      return "Illegal";
  } else {
    // restricted range after Reset/Standby
    if ( sel >=4 && sel < 8  ) 
      return msirange_txt[sel];
    else
      return "Illegal";

  }
}
/* ---- RCC CR ---- */
static void DBG_dump_rcc_cr(void)
{
  DBG_setPadLen(22);
  #if defined(RCC_CR_PLLSAI2ON)
      DBG_dump_bitvalue("PLL_SAI2 on", RCC->CR, RCC_CR_PLLSAI2ON );
      if ( READ_BIT(RCC->CR, RCC_CR_PLLSAI2ON) ) DBG_dump_bitvalue("PLL_SAI2 ready", RCC->CR, RCC_CR_PLLSAI2RDY );
  #endif  
  DBG_dump_bitvalue("PLL_SAI1 on", RCC->CR, RCC_CR_PLLSAI1ON );
  if ( READ_BIT(RCC->CR, RCC_CR_PLLSAI1ON) ) DBG_dump_bitvalue("PLL_SAI1 ready", RCC->CR, RCC_CR_PLLSAI1RDY );

  DBG_dump_bitvalue("PLL on", RCC->CR, RCC_CR_PLLON );
  if ( READ_BIT(RCC->CR, RCC_CR_PLLON) ) DBG_dump_bitvalue("PLL ready", RCC->CR, RCC_CR_PLLRDY );

  DBG_dump_bitvalue("HSE on", RCC->CR, RCC_CR_HSEON );
  if ( READ_BIT( RCC->CR, RCC_CR_HSEON ) ) {
    DBG_dump_bitvalue("HSE ready", RCC->CR, RCC_CR_HSERDY);
    DBG_dump_bitvalue("HSE bypass", RCC->CR, RCC_CR_HSEBYP);
    DBG_dump_bitvalue("HSE CSS on", RCC->CR, RCC_CR_CSSON);
  }

  DBG_dump_bitvalue("HSI Autost. from Stop", RCC->CR, RCC_CR_HSIASFS );

  DBG_dump_bitvalue("HSI on", RCC->CR, RCC_CR_HSION );
  if ( READ_BIT( RCC->CR, RCC_CR_HSION ) ) {
    DBG_dump_bitvalue("HSI ready", RCC->CR, RCC_CR_HSIRDY);
    DBG_dump_bitvalue("HSIKern on", RCC->CR, RCC_CR_HSIKERON );
  }
  DBG_dump_bitvalue("MSI on", RCC->CR, RCC_CR_MSION );
  if ( READ_BIT( RCC->CR, RCC_CR_MSION ) ) {
    DBG_dump_bitvalue("MSI ready", RCC->CR, RCC_CR_MSIRDY);
    DBG_dump_bitvalue("MSI PLL enable", RCC->CR, RCC_CR_MSIPLLEN);
    DBG_dump_textvalue("MSI Range Select", READ_BIT( RCC->CR, RCC_CR_MSIRGSEL ) ? "Normal, full range" : "after StBy/Reset, restricted");

    if ( READ_BIT( RCC->CR, RCC_CR_MSIRGSEL ) ) 
      DBG_dump_textvalue("MSI Freq.", DBG_get_msirange_text((RCC->CR & RCC_CR_MSIRANGE_Msk)>>RCC_CR_MSIRANGE_Pos, 1) );
    else  
      DBG_dump_textvalue("MSI Freq.", DBG_get_msirange_text((RCC->CSR & RCC_CSR_MSISRANGE_Msk) >> RCC_CSR_MSISRANGE_Pos, 0) );
  }
}

const char * const rtcsel_txt[]={"No Clock","LSE","LSI","HSE/32"};
static const char* DBG_get_rcc_bdcr_rtcsel_txt(uint32_t sel)
{
  if ( sel < sizeof(rtcsel_txt)/sizeof(char *) ) 
    return rtcsel_txt[sel];
  else
    return "Illegal";
}

/* ---- RCC BDCR ---- */
static void DBG_dump_rcc_bdcr(void)
{
  DBG_setPadLen(16);
  DBG_dump_bitvalue("LSCO enable", RCC->BDCR, RCC_BDCR_LSCOEN);
  if ( READ_BIT( RCC->BDCR, RCC_BDCR_LSCOEN ) ) 
    DBG_dump_textvalue("LSCO source", READ_BIT(RCC->BDCR, RCC_BDCR_LSCOSEL) ? "LSE" : "LSI" );

  DBG_dump_bitvalue("RTC enable", RCC->BDCR, RCC_BDCR_RTCEN );
  if ( READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) )
    DBG_dump_textvalue("RTC/LCD Clk source", DBG_get_rcc_bdcr_rtcsel_txt((RCC->BDCR & RCC_BDCR_RTCSEL_Msk) >> RCC_BDCR_RTCSEL_Pos));
  
  DBG_dump_bitvalue("LSE CSS enable", RCC->BDCR, RCC_BDCR_LSECSSON);
  if ( READ_BIT(RCC->BDCR, RCC_BDCR_LSECSSON) ) 
    DBG_dump_bitvalue("LSE Clk failure", RCC->BDCR, RCC_BDCR_LSECSSD);
    
  DBG_dump_bitvalue("LSE on", RCC->BDCR, RCC_BDCR_LSEON );
  if ( READ_BIT(RCC->BDCR, RCC_BDCR_LSEON ) ) {
    DBG_dump_bitvalue("LSE rdy", RCC->BDCR, RCC_BDCR_LSERDY);
    DBG_dump_bitvalue("LSE bypass", RCC->BDCR, RCC_BDCR_LSEBYP);
    DBG_dump_number("LSE drv strength", (RCC->BDCR & RCC_BDCR_LSEDRV_Msk) >> RCC_BDCR_LSEDRV_Pos);
  }
}

/* ---- RCC ICSCR ---- */
static void DBG_dump_rcc_icscr(void)
{
  DBG_setPadLen(16);
  if ( READ_BIT(RCC->CR, RCC_CR_MSION) ) {
    DBG_dump_number("MSI Calibration", ( RCC->ICSCR & RCC_ICSCR_MSICAL_Msk ) >> RCC_ICSCR_MSICAL_Pos );
    DBG_dump_number("MSI Trimming", (RCC->ICSCR & RCC_ICSCR_MSITRIM_Msk ) >> RCC_ICSCR_MSITRIM_Pos );
  }
  if ( READ_BIT(RCC->CR, RCC_CR_HSION) ) {
    DBG_dump_number("HSI Calibration", (RCC->ICSCR & RCC_ICSCR_HSICAL_Msk ) >> RCC_ICSCR_HSICAL_Pos );
    DBG_dump_number("HSI Trimming", (RCC->ICSCR & RCC_ICSCR_HSITRIM_Msk ) >> RCC_ICSCR_HSITRIM_Pos );
  }
}

/* ---- RCC CFGR ---- */
const char * const mosel_txt[]={"MCO disabled","SYSCLK","MSI","HSI16","HSE","PLL","LSI","LSE"};
static const char* DBG_get_rcc_cfgr_mcosel_txt(uint32_t sel)
{
  if ( sel < sizeof(mosel_txt)/sizeof(char *) ) 
    return mosel_txt[sel];
  else
    return "Illegal";
}

/*
 * decode APB1 and APB2 prescaler values, see Ref.man. p 224 
 */
static int DBG_get_rcc_cfgr_apb_prescaler ( uint32_t inval )
{
  inval &= 0b111;
  if ( inval < 4 ) return 1;
  return 1 << ( inval-3 );
}

/*
 * decode AHB prescaler values, see Ref.man. p 224
 */
#if 0
static int DBG_get_rcc_cfgr_ahb_prescaler ( uint32_t inval )
{
  inval &= 0b1111;
  if ( inval < 0b1000 ) return 1;
  if ( inval < 0b1100 ) 
    return 1 << ( inval - 7 );
  else
   return 1 << ( inval - 6 );
}
#endif

const char * const sws_txt[]={"MSI","HSI16", "HSE", "PLL"};
static const char* DBG_get_rcc_cfgr_sws_txt(uint32_t sel)
{
  if ( sel < sizeof(sws_txt)/sizeof(char *) ) 
    return sws_txt[sel];
  else
    return "Illegal";
}

static void DBG_dump_rcc_cfgr(void)
{
  DBG_setPadLen(16);
  uint32_t mcosel = ( RCC->CFGR & RCC_CFGR_MCOSEL_Msk ) >> RCC_CFGR_MCOSEL_Pos;

  if ( mcosel == 0 ) {
    DBG_printf_indent("MCO disabled\n" );    
  } else {
    DBG_dump_po2("MCO prescaler",  (( RCC->CFGR & RCC_CFGR_MCOPRE_Msk ) >> RCC_CFGR_MCOPRE_Pos) );
    DBG_dump_textvalue("MCO Source", DBG_get_rcc_cfgr_mcosel_txt(( RCC->CFGR & RCC_CFGR_MCOSEL_Msk  ) >> RCC_CFGR_MCOSEL_Pos) );
  }
  DBG_dump_textvalue("WakeUp Clksrc", READ_BIT(RCC->CFGR, RCC_CFGR_STOPWUCK) ? "HSI16" : "MSI" );    
  DBG_dump_number("APB2 Prescale", DBG_get_rcc_cfgr_apb_prescaler(( RCC->CFGR & RCC_CFGR_PPRE2_Msk ) >> RCC_CFGR_PPRE2_Pos) );
  DBG_dump_number("APB1 Prescale", DBG_get_rcc_cfgr_apb_prescaler(( RCC->CFGR & RCC_CFGR_PPRE1_Msk ) >> RCC_CFGR_PPRE1_Pos) );
  DBG_dump_number("AHB Prescale", DBG_get_rcc_cfgr_apb_prescaler(( RCC->CFGR & RCC_CFGR_HPRE_Msk ) >> RCC_CFGR_HPRE_Pos) );
  DBG_dump_textvalue("SysClk source", DBG_get_rcc_cfgr_sws_txt(( RCC->CFGR & RCC_CFGR_SWS_Msk  ) >> RCC_CFGR_SWS_Pos) );
}

/* ---- RCC PLLCFGR ---- */
const char * const pllsrc_txt[]={"No Clock","MSI", "HSI16", "HSE"};
static const char* DBG_get_rcc_pllcfgr_pllsrc_txt(uint32_t sel )
{
  if ( sel < sizeof(pllsrc_txt)/sizeof(char *) ) 
    return pllsrc_txt[sel];
  else
    return "Illegal";
}
static void DBG_dump_rcc_pllcfgr(uint32_t reg)
{
    #define _EN(reg,mask)       ( reg & mask ? "Enabled" : "" )
    DBG_setPadLen(20);
    DBG_dump_textvalue("Source", DBG_get_rcc_pllcfgr_pllsrc_txt(( RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC_Msk  ) >> RCC_PLLCFGR_PLLSRC_Pos) );  
    DBG_dump_number_and_text("M Div", ( (RCC->PLLCFGR & RCC_PLLCFGR_PLLM_Msk ) >> RCC_PLLCFGR_PLLM_Pos)+1, 3, "" );  
    DBG_dump_number_and_text("N Mul", ( reg & RCC_PLLCFGR_PLLN_Msk ) >> RCC_PLLCFGR_PLLN_Pos, 3, "" );   
    DBG_dump_number_and_text("R Div", ((( reg & RCC_PLLCFGR_PLLR_Msk ) >> RCC_PLLCFGR_PLLR_Pos)+1)*2,   3, _EN(reg, RCC_PLLCFGR_PLLREN_Msk) );  
    DBG_dump_number_and_text("Q DIV", ((( reg & RCC_PLLCFGR_PLLQ_Msk ) >> RCC_PLLCFGR_PLLQ_Pos)+1)*2,   3, _EN(reg, RCC_PLLCFGR_PLLQEN_Msk) );    
    DBG_dump_number_and_text("P DIV", (( reg & RCC_PLLCFGR_PLLP_Msk ) >> RCC_PLLCFGR_PLLP_Pos)==0?7:17, 3, _EN(reg, RCC_PLLCFGR_PLLPEN_Msk) );    
}

