rainer20512/stm32-fw/stm32l4/Src/debug_pwr_rcc.c
/*
static void DBG_dump_rcc_pllcfgr(void)
{
  DBG_setPadLen(20);
  if ( READ_BIT(RCC->CR, RCC_CR_PLLON ) ) {
    DBG_dump_bitvalue("PLLCLK out enabled", RCC->PLLCFGR, RCC_PLLCFGR_PLLPEN);
    DBG_dump_textvalue("PLL source", DBG_get_rcc_pllcfgr_pllsrc_txt(( RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC_Msk  ) >> RCC_PLLCFGR_PLLSRC_Pos) );  
    DBG_dump_number("PLLM", ( RCC->PLLCFGR & RCC_PLLCFGR_PLLM_Msk ) >> RCC_PLLCFGR_PLLM_Pos );  
    DBG_dump_number("PLLN", ( RCC->PLLCFGR & RCC_PLLCFGR_PLLN_Msk ) >> RCC_PLLCFGR_PLLN_Pos );  
    DBG_dump_number("PLLR", ( RCC->PLLCFGR & RCC_PLLCFGR_PLLR_Msk ) >> RCC_PLLCFGR_PLLR_Pos );  
    DBG_dump_number("PLLQ", ( RCC->PLLCFGR & RCC_PLLCFGR_PLLQ_Msk ) >> RCC_PLLCFGR_PLLQ_Pos );  
    DBG_dump_number("PLLP", ( RCC->PLLCFGR & RCC_PLLCFGR_PLLP_Msk ) >> RCC_PLLCFGR_PLLP_Pos );  
  } else  {
    DBG_printf_indent("PLL disabled\n" );    
  }
}
*/

static void DBG_dump_clocks(void)
{
  RCC_ClkInitTypeDef v;
  uint32_t f_latency;

  DBG_setPadLen(16);
  DBG_dump_number("SYSCLK", HAL_RCC_GetSysClockFreq() );
  DBG_dump_number("HCLK",  HAL_RCC_GetHCLKFreq());
  DBG_dump_number("PCLK1",  HAL_RCC_GetPCLK1Freq());
  DBG_dump_number("PCLK2",  HAL_RCC_GetPCLK2Freq());
  HAL_RCC_GetClockConfig(&v, &f_latency);
  DBG_dump_textvalue("Vcore value", DBG_get_pwr_cr1_vos_txt());
  DBG_dump_number("Flash Latency", f_latency);  
}


void DBG_dump_clocksetting(void)
{
  DEBUG_PUTS("RCC Settings ------------------------------------" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  Clock Control register *****************/
  DBG_printf_indent("RCC: Clock Control Register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_cr();
  DBG_setIndentRel(-2);

  /********  Backup Domain Control register *****************/
  DBG_printf_indent("RCC: Backup Domain Control Register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_bdcr();
  DBG_setIndentRel(-2);

  /********  MSI/HSI calibration register *****************/
  if (  READ_BIT(RCC->CR, RCC_CR_MSION) || READ_BIT(RCC->CR, RCC_CR_HSION ) ) {
    DBG_printf_indent("RCC: MSI/HSI Calibration Register\n" );
    DBG_setIndentRel(+2);
    DBG_dump_rcc_icscr();
    DBG_setIndentRel(-2);
  }

  /******** Clock configuration register *****************/
  DBG_printf_indent("RCC: Clock configuration register\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_cfgr();
  DBG_setIndentRel(-2);

  /******** PLL configuration register *****************/
  if ( RCC->CR & RCC_CR_PLLON) {
      DBG_printf_indent("RCC: PLL configuration register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_pllcfgr( RCC->PLLCFGR );
      DBG_setIndentRel(-2);
  }

  if ( RCC->CR & RCC_CR_PLLSAI1ON) {
      DBG_printf_indent("RCC: PLLSAI1 configuration register\n" );
      DBG_setIndentRel(+2);
      DBG_dump_rcc_pllcfgr( RCC->PLLSAI1CFGR );
      DBG_setIndentRel(-2);
  }

  #if defined(RCC_CR_PLLSAI2ON)
      if ( RCC->CR & RCC_CR_PLLSAI2ON) {
          DBG_printf_indent("RCC: PLLSAI2 configuration register\n" );
          DBG_setIndentRel(+2);
          DBG_dump_rcc_pllcfgr( RCC->PLLSAI2CFGR );
          DBG_setIndentRel(-2);
      }
  #endif
    
  /******** System Clocks *****************/
  DBG_printf_indent("Resulting System Clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_clocks();
  DBG_setIndentRel(-2);


  DBG_setIndentAbs(oldIndent);
}

/*
 *************************************************************
 * Functions to dump peripheral clock settings
 *************************************************************
 */

/*
 *************************************************************
 * The follwowing routines are used to dump ordinary and
 * sleep mode register settings, so the register is passed as 
 * parameter. This only works, because bit positions in 
 * ordinary and sleep mode registers are identical
 *************************************************************
 */
void DBG_dump_rcc_ahbenr(uint32_t reg1, uint32_t reg2, uint32_t reg3, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "AHB1SMENR raw " : "AHB1ENR raw ", reg1 );  
  DBG_dump_uint32_hex(bSleepRegisters ? "AHB2SMENR raw " : "AHB2ENR raw ", reg2 );  
  DBG_dump_uint32_hex(bSleepRegisters ? "AHB3SMENR raw " : "AHB3ENR raw ", reg3 );  

#if defined(STM32L4PLUS_FAMILY)
  #if defined(RCC_AHB1ENR_GFXMMUEN)
    DBG_dump_onoffvalue  ("GFXMMU Clock",reg1, RCC_AHB1ENR_GFXMMUEN);  
  #endif
  DBG_dump_onoffvalue  ("DMA2D Clock", reg1, RCC_AHB1ENR_DMA2DEN);  
#endif
  DBG_dump_onoffvalue  ("TSC Clock",   reg1, RCC_AHB1ENR_TSCEN);  
  DBG_dump_onoffvalue  ("CRC Clock",   reg1, RCC_AHB1ENR_CRCEN);  
  if ( bSleepRegisters)   DBG_dump_onoffvalue  ("SRAM1 Clock", reg1, RCC_AHB1SMENR_SRAM1SMEN);  
  DBG_dump_onoffvalue  ("Flash Clock", reg1, RCC_AHB1ENR_FLASHEN);  
#if defined(DMAMUX1)
  DBG_dump_onoffvalue  ("DMAMUX1 Clock",  reg1, RCC_AHB1ENR_DMAMUX1EN);  
#endif
  DBG_dump_onoffvalue  ("DMA2 Clock",  reg1, RCC_AHB1ENR_DMA2EN);  
  DBG_dump_onoffvalue  ("DMA1 Clock",  reg1, RCC_AHB1ENR_DMA1EN);  

#if defined(STM32L4PLUS_FAMILY)
  DBG_dump_onoffvalue  ("SDMMC1 Clock",  reg2, RCC_AHB2ENR_SDMMC1EN);  
  DBG_dump_onoffvalue  ("SDMMC2 Clock",  reg2, RCC_AHB2ENR_SDMMC2EN);  
  DBG_dump_onoffvalue  ("OSPIMgr Clock", reg2, RCC_AHB2ENR_OSPIMEN);  
#endif
  DBG_dump_onoffvalue  ("RNG Clock",  reg2, RCC_AHB2ENR_RNGEN);  
#if defined(HASH)
  DBG_dump_onoffvalue  ("HASH Clock",  reg2, RCC_AHB2ENR_HASHEN);  
#endif  
#if defined(AES)
  DBG_dump_onoffvalue  ("AES Clock",  reg2, RCC_AHB2ENR_AESEN);  
#endif  
#if defined(PKA)
  DBG_dump_onoffvalue  ("PKA Clock",  reg2, RCC_AHB2ENR_PKAEN);  
#endif  
#if defined(DCMI)
  DBG_dump_onoffvalue  ("DCMI Clock",  reg2, RCC_AHB2ENR_DCMIEN);  
#endif  

  DBG_dump_onoffvalue  ("ADC Clock",  reg2, RCC_AHB2ENR_ADCEN);  
  #if defined(RCC_AHB2ENR_OTGFSEN)
      DBG_dump_onoffvalue  ("OTGFS Clock",  reg2, RCC_AHB2ENR_OTGFSEN);  
  #endif  
  if ( bSleepRegisters)  {
    DBG_dump_onoffvalue  ("SRAM2 Clock", reg2, RCC_AHB2SMENR_SRAM2SMEN);  
    #if defined( RCC_AHB2SMENR_SRAM3SMEN)
        DBG_dump_onoffvalue  ("SRAM3 Clock", reg2, RCC_AHB2SMENR_SRAM3SMEN);  
    #endif
  }
  DBG_dump_onoffvalue  ("GPIOH Clock",  reg2, RCC_AHB2ENR_GPIOHEN);  
  #if defined (GPIOG) 
    DBG_dump_onoffvalue  ("GPIOG Clock",  reg2, RCC_AHB2ENR_GPIOGEN);  
  #endif
  #if defined (GPIOF) 
    DBG_dump_onoffvalue  ("GPIOF Clock",  reg2, RCC_AHB2ENR_GPIOFEN);  
  #endif
  DBG_dump_onoffvalue  ("GPIOE Clock",  reg2, RCC_AHB2ENR_GPIOEEN);  
  DBG_dump_onoffvalue  ("GPIOD Clock",  reg2, RCC_AHB2ENR_GPIODEN);  
  DBG_dump_onoffvalue  ("GPIOC Clock",  reg2, RCC_AHB2ENR_GPIOCEN);  
  DBG_dump_onoffvalue  ("GPIOB Clock",  reg2, RCC_AHB2ENR_GPIOBEN);  
  DBG_dump_onoffvalue  ("GPIOA Clock",  reg2, RCC_AHB2ENR_GPIOAEN);  
    


  #if defined(QSPI)
    DBG_dump_onoffvalue  ("QSPI Clock",  reg3, RCC_AHB3ENR_QSPIEN);  
  #endif
  #if defined(OCTOSPI1)
    DBG_dump_onoffvalue  ("OSPI1 Clock",  reg3, RCC_AHB3ENR_OSPI1EN);  
  #endif
  #if defined(OCTOSPI2)
    DBG_dump_onoffvalue  ("OSPI2 Clock",  reg3, RCC_AHB3ENR_OSPI2EN);  
  #endif
  #if defined(RCC_AHB3ENR_FMCEN)
    DBG_dump_onoffvalue  ("FMC Clock",  reg3, RCC_AHB3ENR_FMCEN);  
  #endif


