rainer20512/stm32-fw/stm32l4/Src/debug_pwr_rcc.c
}

void DBG_dump_rcc_apb1enr(uint32_t reg1, uint32_t reg2, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "APB1SMENR1 raw" : "APB1ENR1 raw", reg1 );  
  DBG_dump_uint32_hex(bSleepRegisters ? "APB1SMENR2 raw" : "APB1ENR2 raw", reg2 );  

  DBG_dump_onoffvalue  ("LPTIM1 Clock", reg1, RCC_APB1ENR1_LPTIM1EN);  
  DBG_dump_onoffvalue  ("OpAmp Clock", reg1, RCC_APB1ENR1_OPAMPEN);  
  DBG_dump_onoffvalue  ("DAC1 Clock", reg1, RCC_APB1ENR1_DAC1EN);  
  DBG_dump_onoffvalue  ("PWR Clock", reg1, RCC_APB1ENR1_PWREN);  
  DBG_dump_onoffvalue  ("CAN1 Clock", reg1, RCC_APB1ENR1_CAN1EN);  
  #if defined(RCC_APB1ENR1_CRSEN)
    DBG_dump_onoffvalue  ("CRS Clock", reg1, RCC_APB1ENR1_CRSEN);  
  #endif
  DBG_dump_onoffvalue  ("I2C3 Clock", reg1, RCC_APB1ENR1_I2C3EN);  
  DBG_dump_onoffvalue  ("I2C2 Clock", reg1, RCC_APB1ENR1_I2C2EN);  
  DBG_dump_onoffvalue  ("I2C1 Clock", reg1, RCC_APB1ENR1_I2C1EN);  
  #if defined(UART5)
    DBG_dump_onoffvalue  ("UART5 Clock", reg1, RCC_APB1ENR1_UART5EN);  
  #endif
  #if defined(UART4)
      DBG_dump_onoffvalue  ("UART4 Clock", reg1, RCC_APB1ENR1_UART4EN);  
  #endif
  DBG_dump_onoffvalue  ("USART3 Clock", reg1, RCC_APB1ENR1_USART3EN);  
  DBG_dump_onoffvalue  ("USART2 Clock", reg1, RCC_APB1ENR1_USART2EN);  
  DBG_dump_onoffvalue  ("SPI3 Clock", reg1, RCC_APB1ENR1_SPI3EN);  
  DBG_dump_onoffvalue  ("SPI2 Clock", reg1, RCC_APB1ENR1_SPI2EN);  
  DBG_dump_onoffvalue  ("WWDG Clock", reg1, RCC_APB1ENR1_WWDGEN);  
#if defined(STM32L476xx) || defined(STM32L496xx)
  DBG_dump_onoffvalue  ("LCD Clock", reg1, RCC_APB1ENR1_LCDEN);  
#endif
#if defined(STM32L4PLUS_FAMILY)
  DBG_dump_onoffvalue  ("RTC APB Clock", reg1, RCC_APB1ENR1_RTCAPBEN);  
#endif
  DBG_dump_onoffvalue  ("TIM7 Clock", reg1, RCC_APB1ENR1_TIM7EN);  
  DBG_dump_onoffvalue  ("TIM6 Clock", reg1, RCC_APB1ENR1_TIM6EN);  
  #if defined(TIM5)
    DBG_dump_onoffvalue  ("TIM5 Clock", reg1, RCC_APB1ENR1_TIM5EN);  
  #endif
  #if defined(TIM4)
    DBG_dump_onoffvalue  ("TIM4 Clock", reg1, RCC_APB1ENR1_TIM4EN);  
  #endif
  #if defined(TIM3)
    DBG_dump_onoffvalue  ("TIM3 Clock", reg1, RCC_APB1ENR1_TIM3EN);  
  #endif
  DBG_dump_onoffvalue  ("TIM2 Clock", reg1, RCC_APB1ENR1_TIM2EN);  

  DBG_dump_onoffvalue  ("LPTIM2 Clock", reg2, RCC_APB1ENR2_LPTIM2EN);  
#if defined(STM32L476xx) || defined(STM32L496xx)
  DBG_dump_onoffvalue  ("SWPMI1 Clock", reg2, RCC_APB1ENR2_SWPMI1EN);  
#endif
#if defined(STM32L4PLUS_FAMILY)
    #if defined(RCC_APB1ENR2_I2C4EN) 
      DBG_dump_onoffvalue  ("I2C4 Clock",   reg2, RCC_APB1ENR2_I2C4EN);  
    #endif
#endif
  DBG_dump_onoffvalue  ("LPUART1 Clock", reg2, RCC_APB1ENR2_LPUART1EN);  
} 

void DBG_dump_rcc_apb2enr(uint32_t reg, uint32_t bSleepRegisters )
{
  DBG_setPadLen(16);
  DBG_dump_uint32_hex(bSleepRegisters ? "APB2SMENR raw" : "APB2ENR raw",reg );  
#if defined(STM32L4PLUS_FAMILY)
  #if defined(RCC_APB2ENR_DSIEN)
    DBG_dump_onoffvalue  ("DSI Clock", reg, RCC_APB2ENR_DSIEN);  
  #endif
  DBG_dump_onoffvalue  ("LTDC Clock", reg, RCC_APB2ENR_LTDCEN);  
#endif
  #if defined(RCC_APB2ENR_DFSDM1EN)  
    DBG_dump_onoffvalue  ("DFSDM1 Clock", reg, RCC_APB2ENR_DFSDM1EN);  
  #endif
  #if defined(RCC_APB2ENR_SAI2EN)
    DBG_dump_onoffvalue  ("SAI2 Clock", reg, RCC_APB2ENR_SAI2EN);
  #endif
  DBG_dump_onoffvalue  ("SAI1 Clock", reg, RCC_APB2ENR_SAI1EN);  
  #if defined (RCC_APB2ENR_TIM17EN)
    DBG_dump_onoffvalue  ("TIM17 Clock", reg, RCC_APB2ENR_TIM17EN);  
  #endif
  DBG_dump_onoffvalue  ("TIM16 Clock", reg, RCC_APB2ENR_TIM16EN);  
  DBG_dump_onoffvalue  ("TIM15 Clock", reg, RCC_APB2ENR_TIM15EN);  
  DBG_dump_onoffvalue  ("USART1 Clock", reg, RCC_APB2ENR_USART1EN);  
  #if defined(RCC_APB2ENR_TIM8EN)
    DBG_dump_onoffvalue  ("TIM8 Clock", reg, RCC_APB2ENR_TIM8EN);  
  #endif
  DBG_dump_onoffvalue  ("SPI1 Clock", reg, RCC_APB2ENR_SPI1EN);  
  DBG_dump_onoffvalue  ("TIM1 Clock", reg, RCC_APB2ENR_TIM1EN);  
#if defined(STM32L476xx) || defined(STM32L496xx)
  DBG_dump_onoffvalue  ("SDMMC1 Clock", reg, RCC_APB2ENR_SDMMC1EN);  
#endif
  DBG_dump_onoffvalue  ("FW Clock", reg, RCC_APB2ENR_FWEN);  
  DBG_dump_onoffvalue  ("SYSCFG Clock", reg, RCC_APB2ENR_SYSCFGEN);  
}


void DBG_dump_peripheralclocksetting(void)
{
  DEBUG_PUTS("Peripheral Clock Settings -----------------------" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  AHB peripheral clock enable register *****************/
  DBG_printf_indent("AHB peripheral clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_ahbenr(RCC->AHB1ENR, RCC->AHB2ENR, RCC->AHB3ENR, 0);
  DBG_setIndentRel(-2);

  /********  APB1 peripheral clock enable register *****************/
  DBG_printf_indent("APB1 peripheral clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb1enr(RCC->APB1ENR1, RCC->APB1ENR2,0);
  DBG_setIndentRel(-2);

  /********  APB2 peripheral clock enable register *****************/
  DBG_printf_indent("APB2 peripheral clocks\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb2enr(RCC->APB2ENR,0);
  DBG_setIndentRel(-2);

  /********  Backup Domain control register *****************/
  DBG_printf_indent("Backup Domain / RTC clock\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_bdcr();
  DBG_setIndentRel(-2);

  DBG_setIndentAbs(oldIndent);
}

void DBG_dump_peripheralclocksetting_insleepmode(void)
{
  DEBUG_PUTS("Peripheral Clock Settings ** IN SLEEP MODE ** ---" );
  int oldIndent = DBG_setIndentRel(+2);

  /********  AHB peripheral clock enable register *****************/
  DBG_printf_indent("AHB peripheral clocks in SleepMode\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_ahbenr(RCC->AHB1SMENR, RCC->AHB2SMENR, RCC->AHB3SMENR, 1);
  DBG_setIndentRel(-2);

  /********  APB1 peripheral clock enable register *****************/
  DBG_printf_indent("APB1 peripheral clocks in SleepMode\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb1enr(RCC->APB1SMENR1, RCC->APB1SMENR2, 1);
  DBG_setIndentRel(-2);

  /********  APB2 peripheral clock enable register *****************/
  DBG_printf_indent("APB2 peripheral clocks in SleepMode\n" );
  DBG_setIndentRel(+2);
  DBG_dump_rcc_apb2enr(RCC->APB2SMENR, 1);
  DBG_setIndentRel(-2);

  DBG_setIndentAbs(oldIndent);
}

const char * const pclk_txt[]={"APB Clk", "SYSCLK", "HSI16 Clk", "LSE clk" };
static const char* DBG_get_perip_clksrc_txt(uint32_t sel, uint32_t bSel4, uint32_t bSpecial)
{
  /* 
   * Clock Source 01 on LPTIM1 is deviating from normal bitcode schema
   * so handle specially
   */
  if ( bSpecial && sel == 1 ) return "LSI Clk";
   
  if ( sel < sizeof(pclk_txt)/sizeof(char *) - ( bSel4 ? 0 : 1 ) ) 
    return pclk_txt[sel];
  else
    return "Illegal";
}


const char * const adcclk_txt[]={"No Clock","PLLSAI1-R","PLLSAI2-R","SYSCLK"};
static const char* DBG_get_rcc_ccipr_adcclk_txt(uint32_t sel)
{
  if ( sel < sizeof(adcclk_txt)/sizeof(char *) ) 
    return adcclk_txt[sel];
  else
    return "Illegal";
}

const char *clk48_txt[]={"No Clock","PLLSAI1-Q","PLL-Q","MSI"};
static const char* DBG_get_rcc_ccipr_clk48_txt(uint32_t sel)
{
  if ( sel < sizeof(clk48_txt)/sizeof(char *) ) 
    return clk48_txt[sel];
  else
    return "Illegal";
}

/* NB: HSI as SAI clock source only on L4Sx and Rx types */
const char *saiclk_txt[]={"PLLSAI1-P","PLLSAI2-P","PLL-P","ext.Clk","HSI"};
static const char* DBG_get_rcc_ccipr_saiclk_txt(uint32_t sel)
{
  if ( sel < sizeof(saiclk_txt)/sizeof(char *) ) 
    return saiclk_txt[sel];
  else
    return "Illegal";
}

