rainer20512/stm32-fw/stm32l4/Src/debug_pwr_rcc.c
#if defined(STM32L43xx) || defined(STM32L476xx) || defined(STM32L496xx)
static void DBG_dump_peripheralclock_specific(void)
{
  #if defined(RCC_APB2ENR_DFSDM1EN)
      if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_DFSDM1EN ) )
        DBG_dump_textvalue("DFSDM1 Clk Source", READ_BIT(RCC->CCIPR , RCC_CCIPR_DFSDM1SEL) ? "SYSCLK" : "APB2CLK" );    
  #endif
  #if defined(RCC_APB1ENR2_SWPMI1EN)
      if ( READ_BIT(RCC->APB1ENR2,RCC_APB1ENR2_SWPMI1EN ) )
        DBG_dump_textvalue("SWPMI1 Clk Source", READ_BIT(RCC->CCIPR , RCC_CCIPR_SWPMI1SEL) ? "HSI16" : "APB1CLK" );    
  #endif
    
  /* CLK48 used by sdmmc, usb and rng */
  #if defined(STM32L43xx)
    if ( READ_BIT(RCC->APB2ENR,RCC_APB2ENR_SDMMC1EN) || READ_BIT(RCC->APB2ENR,RCC_AHB2ENR_RNGEN) ) 
  #else
    if ( READ_BIT(RCC->APB2ENR,RCC_APB2ENR_SDMMC1EN) || READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN) || READ_BIT(RCC->APB2ENR,RCC_AHB2ENR_RNGEN) ) 
  #endif
        DBG_dump_textvalue("CLK48 Source", DBG_get_rcc_ccipr_clk48_txt((RCC->CCIPR & RCC_CCIPR_CLK48SEL_Msk) >> RCC_CCIPR_CLK48SEL_Pos) );    
  
  #if defined(RCC_APB2ENR_SAI2EN)
      if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI2EN ) )
        DBG_dump_textvalue("SAI2 Clk Source", DBG_get_rcc_ccipr_saiclk_txt((RCC->CCIPR & RCC_CCIPR_SAI2SEL_Msk) >> RCC_CCIPR_SAI2SEL_Pos) );    
  #endif
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN ) )
    DBG_dump_textvalue("SAI1 Clk Source", DBG_get_rcc_ccipr_saiclk_txt((RCC->CCIPR & RCC_CCIPR_SAI1SEL_Msk) >> RCC_CCIPR_SAI1SEL_Pos) );    
}
#elif defined(STM32L4PLUS_FAMILY)
const char *ospiclk_txt[]={"HCLK","MSI","PLL-Q"};
static const char* DBG_get_rcc_ccipr_ospiclk_txt(uint32_t sel)
{
  if ( sel < sizeof(ospiclk_txt)/sizeof(char *) ) 
    return ospiclk_txt[sel];
  else
    return "Illegal";
}

static void DBG_dump_peripheralclock_specific(void)
{
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_DFSDM1EN ) )
    DBG_dump_textvalue("DFSDM1 Clk Source", READ_BIT(RCC->CCIPR2 , RCC_CCIPR2_DFSDM1SEL) ? "SYSCLK" : "APB2CLK" );    

/* CLK48 used by sdmmc, usb and rng */
#if defined( RCC_AHB2ENR_SDMMC2EN)
  if ( READ_BIT(RCC->AHB2ENR,(RCC_AHB2ENR_SDMMC2EN | RCC_AHB2ENR_SDMMC1EN)) || READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN) || READ_BIT(RCC->APB2ENR,RCC_AHB2ENR_RNGEN) ) 
#else
  if ( READ_BIT(RCC->AHB2ENR,RCC_AHB2ENR_SDMMC1EN) || READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN) || READ_BIT(RCC->APB2ENR,RCC_AHB2ENR_RNGEN) ) 
#endif
  {
      DBG_dump_textvalue("CLK48 Source", DBG_get_rcc_ccipr_clk48_txt((RCC->CCIPR & RCC_CCIPR_CLK48SEL_Msk) >> RCC_CCIPR_CLK48SEL_Pos) );    
#if defined( RCC_AHB2ENR_SDMMC2EN)
      if ( READ_BIT(RCC->AHB2ENR,(RCC_AHB2ENR_SDMMC2EN | RCC_AHB2ENR_SDMMC1EN)) ) 
#else
      if ( READ_BIT(RCC->AHB2ENR,RCC_AHB2ENR_SDMMC1EN) ) 
#endif
      {
          DBG_dump_textvalue("SDMMC Clk Source", READ_BIT(RCC->CCIPR2 , RCC_CCIPR2_SDMMCSEL) ? "PLL-P" : "CLK48" );    
      }
  }
  #if defined(RCC_APB2ENR_DSIEN)
      if ( READ_BIT(RCC->APB2ENR,RCC_APB2ENR_DSIEN) ) {
          DBG_dump_textvalue("DSI Clk Source", READ_BIT(RCC->CCIPR2 , RCC_CCIPR2_DSISEL) ? "PLL-DSI" : "DSI-PHY" );    
      }
  #endif
    
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI2EN ) )
    DBG_dump_textvalue("SAI2 Clk Source", DBG_get_rcc_ccipr_saiclk_txt((RCC->CCIPR2 & RCC_CCIPR2_SAI2SEL_Msk) >> RCC_CCIPR2_SAI2SEL_Pos) );    
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN ) )
    DBG_dump_textvalue("SAI1 Clk Source", DBG_get_rcc_ccipr_saiclk_txt((RCC->CCIPR & RCC_CCIPR2_SAI1SEL_Msk) >> RCC_CCIPR2_SAI1SEL_Pos) );   
  if ( READ_BIT(RCC->AHB3ENR, ( RCC_AHB3ENR_OSPI1EN | RCC_AHB3ENR_OSPI2EN) ) )
    DBG_dump_textvalue("OCTOSPI Clk Source", DBG_get_rcc_ccipr_ospiclk_txt((RCC->CCIPR2 & RCC_CCIPR2_OSPISEL_Msk) >> RCC_CCIPR2_OSPISEL_Pos) );   
  if ( READ_BIT(RCC->AHB3ENR, ( RCC_AHB3ENR_OSPI1EN | RCC_AHB3ENR_OSPI2EN) ) )
    DBG_dump_textvalue("OCTOSPI Clk Source", DBG_get_rcc_ccipr_ospiclk_txt((RCC->CCIPR2 & RCC_CCIPR2_OSPISEL_Msk) >> RCC_CCIPR2_OSPISEL_Pos) );   
  /* RHB ToDo: PLLSAI2DIVR, ADFSDMSEL, DFSDMSEL, I2C4SEL */
}
#else
    #error "No hardware specific peripheral clock dump implemented"
#endif

void DBG_dump_peripheralclockconfig(void)
{
  DEBUG_PUTS("Peripheral clock configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(18);
    
  DBG_dump_peripheralclock_specific();

  if ( READ_BIT(RCC->AHB2ENR,RCC_AHB2ENR_ADCEN ) )
    DBG_dump_textvalue("ADC Clk Source", DBG_get_rcc_ccipr_adcclk_txt((RCC->CCIPR & RCC_CCIPR_ADCSEL_Msk) >> RCC_CCIPR_ADCSEL_Pos) );    
  if ( READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM2EN ) )
       DBG_dump_textvalue("LPTIM2Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_LPTIM2SEL_Msk) >> RCC_CCIPR_LPTIM2SEL_Pos,1,1) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_LPTIM1EN ) )
       DBG_dump_textvalue("LPTIM1Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_LPTIM1SEL_Msk) >> RCC_CCIPR_LPTIM1SEL_Pos,1,1) ); 

  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN ) )
       DBG_dump_textvalue("I2C3 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_I2C3SEL_Msk) >> RCC_CCIPR_I2C3SEL_Pos,0,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN ) )
       DBG_dump_textvalue("I2C2 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_I2C2SEL_Msk) >> RCC_CCIPR_I2C2SEL_Pos,0,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN ) )
       DBG_dump_textvalue("I2C1 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_I2C1SEL_Msk) >> RCC_CCIPR_I2C1SEL_Pos,0,0) ); 
  if ( READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPUART1EN ) )
       DBG_dump_textvalue("LPUART1 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_LPUART1SEL_Msk) >> RCC_CCIPR_LPUART1SEL_Pos,1,0) ); 
  #if defined(RCC_APB1ENR1_UART5EN)
      if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN ) )
           DBG_dump_textvalue("UART5 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_UART5SEL_Msk) >> RCC_CCIPR_UART5SEL_Pos,1,0) ); 
  #endif
  #if defined(RCC_APB1ENR1_UART4EN)
      if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN ) )
           DBG_dump_textvalue("UART4 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_UART4SEL_Msk) >> RCC_CCIPR_UART4SEL_Pos,1,0) ); 
  #endif  
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN ) )
       DBG_dump_textvalue("USART3 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_USART3SEL_Msk) >> RCC_CCIPR_USART3SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN ) )
       DBG_dump_textvalue("USART2 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_USART2SEL_Msk) >> RCC_CCIPR_USART2SEL_Pos,1,0) ); 
  if ( READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN ) )
       DBG_dump_textvalue("USART1 Clk source", DBG_get_perip_clksrc_txt((RCC->CCIPR & RCC_CCIPR_USART1SEL_Msk) >> RCC_CCIPR_USART1SEL_Pos,1,0) ); 

  DBG_setIndentAbs(oldIndent);
}

void DBG_dump_rtcclockconfig(void)
{
  DEBUG_PUTS("Peripheral clock configuration ------------------" );
  int oldIndent = DBG_setIndentRel(+2);
  DBG_setPadLen(18);

  DBG_printf_indent("Not implemented yet");

  DBG_setIndentAbs(oldIndent);
}

#endif // #if DEBUG_FEATURES > 0

/**
  * @}
  */
